const questions = [
    {
      id: "0",
      question: "Назначение, виды и классификация металлорежущего оборудования",
      text: "<p><b>Металлорежущий станок</b> – оборудование, на котором на котором путем снятия припуска с заготовки в виде стружки получают деталь с заданными размерами, формой, взаимным расположением и шероховатостью поверхностей</p><p>Виды (группы) металлорежущих станков:</p><p>1 - токарные</p><img class=img_question src=../img/1_2/img1_1.jpg><p>2 - сверлильные и расточные</p><img class=img_question src=../img/1_2/img1_2.jpg><p>3 - шлифовальные, полировальные, доводочные, заточные</p><img class=img_question src=../img/1_2/img1_3.jpg>"
    },
    {
        id: "1",
        question: "Назначение, виды и классификация металлорежущего оборудования",
        text: "<p>4 - электрофизические и электрохимические</p><img class=img_question src=../img/1_2/img1_4.jpg><p>5 - зубо- и резьбообрабатывающие</p><img class=img_question src=../img/1_2/img1_5.jpg><p>6 - фрезерные</p><img class=img_question src=../img/1_2/img1_6.jpg>"
    },
    {
        id: "2",
        question: "Назначение, виды и классификация металлорежущего оборудования",
        text: "<p>7 - строгальные, долбежные, протяжные</p><img class=img_question src=../img/1_2/img1_7.jpg><p>8 - разрезные</p><img class=img_question src=../img/1_2/img1_8.jpg><p>9 - разные</p><img class=img_question src=../img/1_2/img1_9.jpg>"
    },
    {
        id: "3",
        question: "Назначение, виды и классификация металлорежущего оборудования",
        text: "<p>В свою очередь, каждая группа подразделяется на 10 типов (подгрупп), характеризующих назначение станков, их компоновку, степень автоматизации или вид применяемого инструмента.</p><img class=img_question_table src=../img/1_2/img1_10.jpg><br><br>"
    },
    {
        id: "4",
        question: "Назначение, виды и классификация металлорежущего оборудования",
        text: "<p>Классификация металлорежущих станков <i>по классу точности:</i></p><ul><li>(Н) нормальной точности</li><li>(П) повышенной точности</li><li>(В) высокой точности</li><li>(А) особо высокой точности</li><li>(С) особо точные станки (мастер-станки)</li></ul><p>Классификация металлорежущих станков <i>по массе:</i></p><ul><li>легкие (˂ 1 т)</li><li>средние (1-10 т)</li><li>тяжелые (> 10 т)</li><li>уникальные (> 100 т)</li></ul><p>Классификация металлорежущих станков <i>по степени автоматизации:</i></p><ul><li>ручные</li><li>полуавтоматы</li><li>автоматы</li><li>станки с ЧПУ</li><li>гибкие производственные системы</li></ul><p>Классификация металлорежущих станков <i>по степени специализации:</i></p><ul><li>универсальные</li><li>специализированные</li><li>специальные</li></ul>"
    },
    {
        id: "5",
        question: "Выбор металлорежущего оборудования для реализации технологического процесса",
        text: "При выборе металлорежущего оборудования необходимо учитывать:<ol><li>Объем выпускаемой продукции, тип производства</li><li>Размеры детали и расположение обрабатываемых поверхностей</li><li>Требования к точности, качеству и экономичностиобработки</li><li>Наиболее полное использование станке по мощности и загрузке (времени работы)</li><li>Удобство управления и обслуживания станка</li><li>Стоимость станка</li><li>Необходимость использования имеющихся станков</li><li>Ориентацию на применение станков отечественного производства</li></ol>Техническая характеристика станка должна отвечать требованиям:<ol><li>Рабочая зона станка (высота центров, расстояние между центрами, размер стола и т.п.) должна соответствовать габаритам обрабатываемой детали</li><li>Мощность, жесткость и кинематические возможности станка позволять вести работу на оптимальных режимах резания</li><li>Производительность станка соответствовать заданному объему выпуска изделий</li></ol>При проектировании технологических процессов выбирают наиболее технически и экономически подходящее оборудование. Как правило, в единичном производстве используется универсальное оборудова¬ние, в мелкосерийном - станки с ЧПУ и универсальные, в среднесерийном - станки с ЧПУ и обрабатывающие центры. В крупносерийном - станки с ЧПУ, обрабатывающие центры, полуавтоматы, автоматы. В массовом производстве - обрабатывающие центры, автоматы, автоматические линии, роторные и роторно-конвейерные линии.<br><br>"
    },
    {
        id: "6",
        question: "Режущий инструмент: типы, виды исполнения и материалы режущей части инструмента",
        text: "<b>Режущий инструмент</b>  – инструмент, предназначенный для изменения формы и размеров заготовки путём удаления части материала в виде стружки с целью получения готовой детали или полуфабриката.<br>По характеру обработки режущие инструменты различают:<ul><li><i>лезвийные</i> – срезают лишний материал</li><li><i>абразивные</i> – истирают поверхность, доводя её до нужной геометрии шлифованием</li><li><i>отделочно-упрочняющей</i> - обрабатывают поверхности пластическим деформированием</li></ul>По конструктивному исполнению они могут быть:<ul><li><i>цельные</i> – полностью выполнены из одной заготовки</li><li><i>составные</i> – изготавливаются из нескольких деталей, соединение неразъемное</li><li><i>сборные</i> – детали инструмента можно разъединить</li></ul><p><i>По варианту крепления</i> выделяют насадные и хвостовые</p><p>В зависимости от формы обрабатываемой поверхности лезвийный инструмент подразделяется на:</p><ul><li><i>резцы токарные и строгальные</i></li><li><i>сверла, зенкеры, развертки, цековки и зенковки</i></li><li><i>фрезы</i></li><li><i>протяжки и прошивки</i></li><li><i>зубообрабатывающий инструмент</i></li><li><i>резьбообрабатывающий инструмент</i></li><li><i>комбинированный инструмент</i></li></ul>"

    },
    {
        id: "7",
        question: "Режущий инструмент: типы, виды исполнения и материалы режущей части инструмента",
        text: "<p>Резцы токарные в зависимости от обрабатываемой поверхности могут быть:</p><ul><li><i>проходные</i> - для обработки наружных цилиндрических поверхностей</li><li><i>отрезные</i> - для отрезки заготовок</li><li><i>канавочные</i>-для проточки канавок</li><li><i>расточные</i> - для расточки отверстий</li><li><i>фасонные</i> - для обработки фасонных поверхностей</li></ul><img class=img_question src=../img/1_2/img1.jpg><p><i>Сверла</i> используются для получения отверстий в сплошном материале или для их рассверливания</p><p><i>Зенкеры и развертки</i> применяют для обработки отверстий с целью повышения их качества</p><p><i>Цековки</i> - для обработки торцовой поверхности отверстий</p><p>Все эти инструменты с успехом применяются как на сверлильных, так и на токарных станках</p><img class=img_question src=../img/1_2/img2.jpg>"

    },
    {
        id: "8",
        question: "Режущий инструмент: типы, виды исполнения и материалы режущей части инструмента",
        text: "<p>Фрезы, в зависимости от формы обрабатываемых поверхностей, могут быть:</p><ul><li><i>торцевыми и цилиндрическими</i> - для обработки плоских поверхностей</li><li><i>дисковыми концевыми</i> - для обработки различных пазов и уступов</li><li><i>шпоночными</i> - для обработки шпоночных канавок</li><li><i>Т-образными фрезами</i> - для обработки Т-образных пазов</li><li><i>прорезными и отрезными</i> - для прорезки канавок и отрезки</li><li><i>фасонными и угловыми</i> - для обработки фасонных и угловых поверхностей</li></ul><img class=img_question src=../img/1_2/img3.jpg><p>Протяжки и прошивки бывают:</p><ul><li><i>цилиндрическими</i> - для обработки внутренних цилиндрических поверхностей</li><li><i>шпоночными</i> - для обработки шпоночных пазов </li><li><i>шлицевыми</i> - для обработки шлицев</li><li><i>многогранными и фасонными</i> - для обработки многогранных и фасонных поверхностей</li></ul><img class=img_question src=../img/1_2/img4.jpg>"
    },
    {
        id: "9",
        question: "Режущий инструмент: типы, виды исполнения и материалы режущей части инструмента",
        text: "<p>Зубообрабатывающий лезвийный инструмент в зависимости от методов обработки зубьев (копирования или обкатки) подразделяют на:</p><ul><li><i>дисковые модульные фрезы</i></li><li><i>пальцевые модульные фрезы</i></li><li><i>червячные фрезы</i></li><li><i>зубообрабатывающие долбяки</i></li><li><i>зубострогальные резцы, резцовые и зуборезные головки</i> - для обработки конических зубчатых колес</li><li><i>шеверы</i> - для чистовой обработки зубьев</li></ul><img class=img_question src=../img/1_2/img5.jpg>"
    },
    {
        id: "10",
        question: "Режущий инструмент: типы, виды исполнения и материалы режущей части инструмента",
        text: "<p>Резьбообрабатывающий инструмент в зависимости от размеров и положения цилиндрической поверхности (наружная или внутренняя) подразделяют на:</p><ul><li><i>плашки и плоские резьбонарезные гребенки</i> - для наружных резьб диаметром до 105 мм</li><li><i>резьбонарезные самораскрывающиеся головки с круглыми гребенками</i> - для наружных резьб диаметром до 60 мм</li><li><i>гребенчатые резьбовые фрезы</i> - для наружных резьб диаметром 32... 100 мм в крупносерийном и массовом производстве</li><li><i>дисковые резьбовые фрезы</i> - для трапецеидальных наружных резьб диаметром 80... 100 мм и шагом до 24 мм</li><li><i>вихревые резьбонарезные головки</i> - для наружных резьб диаметром 20... 200 мм и шагом более 4 мм</li><li><i>резьбовые резцы</i></li><li><i>метчики</i> - для внутренних резьб</li><li><i>концевые гребенчатые резьбовые фрезы</i> - для обработки внутренних резьб диа¬метром до 200 мм</li></ul><img class=img_question src=../img/1_2/img6.jpg>"
    },
    {
        id: "11",
        question: "Режущий инструмент: типы, виды исполнения и материалы режущей части инструмента",
        text: "<p>Комбинированный инструмент чаще всего изготавливается для обработки отверстий:</p><ul><li><i>сверло-зенкер</i></li><li><i>зенкер-развертка</i></li><li><i>сверло-развертка</i></li><li><i>зенкер-зенковка и т.д.</i></li></ul><img class=img_question src=../img/1_2/img7.jpg><p>При подборе материала для изготовления режущей части инструмента требуется учитывать следующие критерии:</p><ul><li>конструкцию инструмента</li><li>•	технологию производства режущего инструмента</li><li>частоту использования</li></ul><p>Материалы для режущего инструмента должны обладать высокой твердостью и износостойкостью, достаточной прочностью и вязкостью, способностью сохранять большую твердость при высоких температурах нагрева. При черновой обработке материал инструмента должен иметь в первую очередь высокую прочность и достаточную вязкость; при чистовой, окончательной обработке — главным образом износостойкость; при обработке высоколегированных сталей и сплавов — теплостойкость.</p>"
    },
    {
        id: "12",
        question: "Основы выбора инструмента и материалов режущей части",
        text: "<p>При выборе режущего инструмента необходимо учитывать:</p><ul><li>способ обработки и тип станка</li><li>точность и качество обработки</li><li>форму и размеры обрабатываемых поверхностей</li><li>материал заготовки и его механических свойств</li><li>заданную производительность</li><li>период стойкости инструмента</li></ul><p>Режущие инструменты (особенно для станков с ЧПУ) должныобладать высокой режущей способностью (стабильной размерной стойкостью при высоких режимах резания), обеспечить возможность быстрой и удобной замены, наладки в процессе работы, формировать транспортабельную стружку и отводить ее от зоны обработки без нарушения нормальной работы оборудования</p><p>В качестве материала режущей части применяют:</p><ul><li><i>инструментальные стали</i> – углеродистые стали У10, У12 для сверл, метчиков, плашек, легированные стали ХВ5, ХВГ для протяжек и фрез</li><li><i>быстрорежущие стали</i> – Р6М5, Р18, Р9К5, Р9Ф5, Р9К10 для обработки вязких, но прочных сталей (жаропрочных), для резьбонарезного и рассверливающего инструмента </li><li><i>твердые сплавы</i> – вольфрамокобальтовые ВК3, ВК6, ВК8 в режущих инструментах для обработки чугуна, титанокобальтовые Т5К10, Т15К6, Т30К6 для обработки стали </li><li><i>минералокерамические сплавы</i> – микролит (ЦМ332) и термокорунд (ЦВ14) при чистовой обработке жестких заготовок из чугуна и стали</li><li><i>абразивные материалы</i> – электрокорунд, карбид кремния, эльбор и др. для шлифования, хонингования</li><li><i>искусственные алмазы и сверхтвердые материалы</i> – для выглаживания</li></ul>"
    },
    {
        id: "13",
        question: "Назначение, виды и классификация технологических приспособлений",
        text: "<p><b>Технологические приспособления</b> – вспомогательные устройства к технологическому оборудованию, используемые при выполнении операций механической обработки, сборки и контроля</p><p>По целевому назначению приспособления делят на:</p><ul><li><i>станочные приспособления</i> – для установки и закрепления обрабатываемых заготовок на станках</li><img class=img_question src=../img/1_2/img8.jpg><li><i>приспособления для крепления режущего инструмента</i></li><img class=img_question src=../img/1_2/img9.jpg><li><i>сборочные приспособления</i> – используют при выполнении сборочных операций</li><img class=img_question src=../img/1_2/img10.jpg></ul>"
    },
    {
        id: "14",
        question: "Назначение, виды и классификация технологических приспособлений",
        text: "<ul><li><i>контрольно-измерительные приспособления</i> – применяют для контроля заготовок, промежуточного и окончательного контроля, а также для проверки собранных узлов и машин </li><img class=img_question src=../img/1_2/img11.jpg><li><i>приспособления для захвата, перемещения и перевертывания обрабатываемых заготовок</i>, а также отдельных деталей и узлов при сборке</li><img class=img_question src=../img/1_2/img12.jpg></ul>"
    },
    {
        id: "15",
        question: "Назначение, виды и классификация технологических приспособлений",
        text: "<p>По степени специализации приспособления делят на:</p><ul><li><i>универсальные приспособления</i> (УП) – используют для расширения технологических возможностей металлорежущих станков. К ним относятся универсальные, поворотные, делительные столы, самоцентрирующие патроны</li><img class=img_question src=../img/1_2/img13.jpg><li><i>универсальные безналадочные приспособления</i> (УБП) – применяются для базирования и закрепления однотипных заготовок. К этому типу принадлежат универсальные патроны с неразъемными кулачками, универсальные фрезерные и слесарные тиски</li><img class=img_question src=../img/1_2/img14.jpg></ul><li><i>универсально-наладочные приспособления</i> (УНП) – используют для базирования и закрепления заготовок в условиях многономенклатурного производства, состоят из постоянного корпуса с приводом и сменной наладки, изготавливаемой в соответствии с контуром заготовки. К ним относятся универсальные патроны со сменными кулачками, универсальные тиски, скальчатые кондукторы</li><img class=img_question src=../img/1_2/img15.jpg>"
    },
    {
        id: "16",
        question: "Назначение, виды и классификация технологических приспособлений",
        text: "<ul><li><i>специализированные безналадочные приспособления</i> (СБП) используют для базирования и закрепления заготовок, близких по конструктивным признакам и требующих одинаковой обработки. К таким приспособлениям принадлежат приспособления для обработки ступенчатых валиков, втулок, фланцев, дисков, корпусных деталей и др.</li><img class=img_question src=../img/1_2/img16.jpg><li><i>специализированные наладочные приспособления</i> (СНП) применяют для базирования и закрепления заготовок, близких по конструктивно-технологическим признакам и требующих для их обработки выполнения однотипных операций и специальных наладок</li><img class=img_question src=../img/1_2/img17.jpg><li><i>универсально-сборные приспособления</i> (УСП) сборно-разборные приспособления (СРП) компонуют из нормализованных обратимых деталей и узлов, допускающих многократную перекомпоновку собираемых конструкций</li><img class=img_question src=../img/1_2/img18.jpg></ul>"
    },
    {
        id: "17",
        question: "Назначение, виды и классификация технологических приспособлений",
        text: "<ul><li><i>неразборные специальные приспособления</i> (НСП) используют для выполнения определенной операции и при обработке конкретной детали. Такие приспособления называются одноцелевыми</li><img class=img_question src=../img/1_2/img19.jpg></ul><p>По степени механизации и автоматизации приспособления подразделяют на:</p><ul><li><i>ручные</i></li><li><i>механизированные</i></li><li><i>полуавтоматические</i></li><li><i>автоматические</i></li></ul><p>По технологическому назначению в зависимости от типа используемого оборудования: <i>токарные, фрезерные, шлифовальные</i> и другие</p>"
    },
    {
        id: "18",
        question: "Основы выбора технологических приспособлений",
        text: "<p>Выбор технологических приспособлений зависит от формы, габаритных размеров и технических требований, предъявляемых к обрабатываемым деталям, а также от типа производства и программы выпуска изделий.</p><p>Выбор типа приспособления в основном зависит от серийности производства.</p><p>В условиях <i>единичного и мелкосерийного производства</i> экономически выгодны универсальные приспособления систем УБП и УСП, ручные.</p><p>В условиях <i>серийного и крупносерийного производства</i> - специализированные приспособления систем СНП, СРП и УНП, механизированные и автоматизированные.</p><p>В условиях <i>массового производства</i> - специальные приспособления системы НСП, автоматические.</p><p>При обработке заготовок <i>на автоматических линиях</i> используются приспособления-спутники, которые одновременно служат и для транспортировки заго¬товки с одной позиции на другую.</p>"
    },
    {
        id: "19",
        question: "Измерительный инструмент: виды и классификация",
        text: "<p><b>Измерительные инструменты</b> - специальные устройства для точного определения размеров, а также других геометрических характеристик деталей и предметов</p><p>В зависимости от назначения применяют следующие измерительные инструменты:</p><ul><li><i>микрометрыгладкие, рычажные, листовые, трубные, призматические</i> и другие, предназначены для определения линейных размеров. Точность измерения до сотых долей мм</li><img class=img_question src=../img/1_2/img20.jpg><li><i>нутромеры</i>, предназначены для определения размеров пазов, отверстий и внутренних отверстий, различают микрометрические и индикаторные. Точность измерения до 0,01 мм.</li><img class=img_question src=../img/1_2/img21.jpg><li><i>кронциркули</i>, предназначены измерения линейных размеров сравнением реальных значений с эталонными</li><img class=img_question src=../img/1_2/img22.jpg></ul>"
    },
    {
        id: "20",
        question: "Измерительный инструмент: виды и классификация",
        text: "<ul><li><i>концевые меры длины</i>, состоят из наборов плиток соединенных посредством сил трения. Используются для контроля точности измерительных приборов, разметки и других операций</li><img class=img_question src=../img/1_2/img23.jpg><li><i>штангенциркули</i>, предназначены для определения наружных и внутренних размеров деталей с точностью до 0,1 мм. При наличии глубиномера могут использоваться для замера глубины отверстия.</li><img class=img_question src=../img/1_2/img24.jpg><li><i>штангенглубиномеры</i>, предназначены для определения глубин пазов и отверстий с точностью 0,05–0,1 мм</li><img class=img_question src=../img/1_2/img25.jpg></ul>"
    },
    {
        id: "21",
        question: "Измерительный инструмент: виды и классификация",
        text: "<ul><li><i>штангензубомер</i>, предназначен для определения размера зубьев шестеренок и реек с помощью горизонтальной и вертикальной штанг</li><img class=img_question src=../img/1_2/img26.jpg><li><i>штангенрейсмас</i>, используются для определения высоты выступа и разметки деталей</li><img class=img_question src=../img/1_2/img27.jpg><li><i>угломеры</i>, используются для проверки точности углов</li><img class=img_question src=../img/1_2/img28.jpg></ul>"
    },
    {
        id: "22",
        question: "Измерительный инструмент: виды и классификация",
        text: "<ul><li><i>калибры-пробки</li>, предназначены дляконтроля гладких и резьбовых отверстий </li><img class=img_question src=../img/1_2/img29.jpg><li><i>калибры-скобы</i>, предназначены для контроля валов</li><img class=img_question src=../img/1_2/img30.jpg><li><i>шаблоны радиусные и резьбовые</i>, предназначены для определения, соответственно, радиуса кривизны детали или шага резьбы путем приложения к контролируемым поверхностям</li><img class=img_question src=../img/1_2/img31.jpg></ul>"
    },
    {
        id: "23",
        question: "Измерительный инструмент: виды и классификация",
        text: "<ul><li><i>образцы шероховатости поверхностей</i>, предназначены для определенияпараметра шероховатости деталей</li><img class=img_question_img src=../img/1_2/img32.jpg></ul>"
    },
    {
        id: "24",
        question: "Основы выбора измерительного инструмента",
        text: "<p>Правильный выбор измерительного инструмента обеспечивает получение достоверной информации об измеряемом объекте, позволяет оптимизировать затраты производства на контрольные операции</p><p>При выборе измерительного инструмента необходимо учитывать:</p><ul><li>величину допуска на изготовление измеряемого размера</li><li>номинальный размер</li><li>допускаемую погрешность измерения данной детали</li><li>общий контур детали</li><li>способ производства при изготовлении детали</li><li>предельную (допустимую) погрешность измерения</li></ul><p>Правильный выбор измерительного инструмента обеспечивает соответствие его метрологической характеристики:</p><ul><li>диапазон измерения и показаний должен быть больше измеряемого размера</li><li>предельная погрешность выбранного средства измерений должна быть меньше допускаемой погрешности измерения</li></ul><p>На выбор средств измерений влияет характер производства:</p><ul><li><i>в мелкосерийном и единичном производстве</i> используют универсальные измерительного инструменты, регулируемые калибры, применение специальных приспособлений и предельных калибров экономически невыгодно</li><li><i>в серийном производстве</i> используют специальные контрольные приспособления, предельные калибры и реже – универсальные средства измерений</li><li><i>в массовом и крупносерийном производстве</i> используют механизированные и автоматизированные средства измерений, специальные контрольные приспособления и предельные калибры</li></ul>"
    },
  ];
